projectFiles/straightPipe/Re5000/q-500/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// For old versions of OpenFOAM (OF<7)
transportModel Newtonian;

// Laminar viscosity
nu              nu [0 2 -1 0 0 0 0] 8e-07; // 	0.000798/995.71

// Thermal expansion coefficient
beta            beta [0 0 0 -1 0 0 0] 3.0263e-04;

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] 300;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] 7; //cp*mu/k =4178*0.000798/0.58

// Turbulent Prandtl number
Prt             Prt [0 0 0 0 0 0 0] 0.85; //0.7 <Prt < 0.9

// ************************************************************************* //
