projectFiles/straightPipe/Re5000/q-500/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
  
    (0 0 0)        
    (3 0 0)        
    (3 0.2 0)      
    (0 0.2 0)      
    (0 0 0.01)     
    (3 0 0.01)     
    (3 0.2 0.01)   
    (0 0.2 0.01)   
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (60 10 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    heatWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
	    (0 1 5 4)
        );
    }
);


// ************************************************************************* //